lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF54.cpp
/*
 * Platform_nRF54.cpp
 * Copyright (C) 2026 Linar Yusupov
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#if defined(ARDUINO_ARCH_NRF54L15CLEAN)

#include <SPI.h>
#include <Wire.h>

#include <ArduinoJson.h>

#include "../system/SoC.h"
#include "../driver/RF.h"
#include "../driver/EEPROM.h"
#include "../driver/GNSS.h"
#include "../driver/Baro.h"
#include "../driver/LED.h"
#include "../driver/Bluetooth.h"
#include "../driver/EPD.h"
#include "../driver/Battery.h"
#include "../driver/Sound.h"
#include "../protocol/data/NMEA.h"
#include "../protocol/data/GDL90.h"
#include "../protocol/data/D1090.h"
#include "../protocol/data/JSON.h"
#include "../system/Time.h"

#if defined(USE_OLED)
#include "../driver/OLED.h"
#endif /* USE_OLED */

#if defined(ARDUINO_XIAO_NRF54L15_CLEAN)    || \
    defined(ARDUINO_HOLYIOT_25007_NRF54L15) || \
    defined(ARDUINO_NRF54L15DK_PCA10156)    || \
    defined(ARDUINO_GENERIC_NRF54L15_MODULE_36PIN)
#include <variant.h>
#include "nrf54l15_hal.h"

using namespace xiao_nrf54l15;
#else
#error "This nRF54 build variant is not supported!"
#endif /* ARDUINO_NRF54L15 */

// RFM95W pin mapping
lmic_pinmap lmic_pins = {
    .nss = LMIC_UNUSED_PIN,
    .txe = LMIC_UNUSED_PIN,
    .rxe = LMIC_UNUSED_PIN,
    .rst = LMIC_UNUSED_PIN,
    .dio = {LMIC_UNUSED_PIN, LMIC_UNUSED_PIN, LMIC_UNUSED_PIN},
    .busy = LMIC_UNUSED_PIN,
    .tcxo = LMIC_UNUSED_PIN,
};

static struct rst_info reset_info = {
  .reason = REASON_DEFAULT_RST,
};

static uint32_t bootCount __attribute__ ((section (".noinit")));
static Watchdog g_wdt;
static bool wdt_is_active = false;

static nRF54_board_id nRF54_board = NRF54_LR2021EVK1XCS1; /* default */

const char *nRF5x_Device_Manufacturer = SOFTRF_IDENT;
const char *nRF5x_Device_Model = "Academy Edition";

const char *Hardware_Rev[] = {
  [0] = "Unknown",
  [1] = "Unknown",
  [2] = "Unknown",
  [3] = "Unknown"
};

#if defined(EXCLUDE_EEPROM)
eeprom_t eeprom_block;
settings_t *settings = &eeprom_block.field.settings;
#endif /* EXCLUDE_EEPROM */

#if !defined(EXCLUDE_LED_RING)
// Parameter 1 = number of pixels in strip
// Parameter 2 = Arduino pin number (most are valid)
// Parameter 3 = pixel type flags, add together as needed:
//   NEO_KHZ800  800 KHz bitstream (most NeoPixel products w/WS2812 LEDs)
//   NEO_KHZ400  400 KHz (classic 'v1' (not v2) FLORA pixels, WS2811 drivers)
//   NEO_GRB     Pixels are wired for GRB bitstream (most NeoPixel products)
//   NEO_RGB     Pixels are wired for RGB bitstream (v1 FLORA pixels, not v2)
Adafruit_NeoPixel strip = Adafruit_NeoPixel(PIX_NUM, SOC_GPIO_PIN_LED,
                                            NEO_GRB + NEO_KHZ800);
#endif /* EXCLUDE_LED_RING */

#if defined(EXCLUDE_WIFI)
char UDPpacketBuffer[256]; // Dummy definition to satisfy build sequence
#endif /* EXCLUDE_WIFI */

#if defined(USE_SOFTSPI)
#include <SoftSPI.h>
SoftSPI RadioSPI(SOC_GPIO_PIN_EVK_MOSI,
                 SOC_GPIO_PIN_EVK_MISO,
                 SOC_GPIO_PIN_EVK_SCK);
#endif /* USE_SOFTSPI */

#if defined(USE_RTT)
#include <RTTStream.h>

RTTStream RTTSerial;
#endif /* USE_RTT */

char *dtostrf_workaround(double number, signed char width, unsigned char prec, char *s) {
    bool negative = false;

    if (isnan(number)) {
        strcpy(s, "nan");
        return s;
    }
    if (isinf(number)) {
        strcpy(s, "inf");
        return s;
    }

    char* out = s;

    int fillme = width; // how many cells to fill for the integer part
    if (prec > 0) {
        fillme -= (prec+1);
    }

    // Handle negative numbers
    if (number < 0.0) {
        negative = true;
        fillme--;
        number = -number;
    }

    // Round correctly so that print(1.999, 2) prints as "2.00"
    // I optimized out most of the divisions
    double rounding = 2.0;
    for (uint8_t i = 0; i < prec; ++i)
        rounding *= 10.0;
    rounding = 1.0 / rounding;

    number += rounding;

    // Figure out how big our number really is
    double tenpow = 1.0;
    int digitcount = 1;
    while (number >= 10.0 * tenpow) {
        tenpow *= 10.0;
        digitcount++;
    }

    number /= tenpow;
    fillme -= digitcount;

    // Pad unused cells with spaces
    while (fillme-- > 0) {
        *out++ = ' ';
    }

    // Handle negative sign
    if (negative) *out++ = '-';

    // Print the digits, and if necessary, the decimal point
    digitcount += prec;
    int8_t digit = 0;
    while (digitcount-- > 0) {
        digit = (int8_t)number;
        if (digit > 9) digit = 9; // insurance
        *out++ = (char)('0' | digit);
        if ((digitcount == prec) && (prec > 0)) {
            *out++ = '.';
        }
        number -= digit;
        number *= 10.0;
    }

    // make sure the string is terminated
    *out = 0;
    return s;
}

#ifdef NRF_TRUSTZONE_NONSECURE
static constexpr uintptr_t kPowerBase = 0x4010E000UL;
static constexpr uintptr_t kResetBase = 0x4010E000UL;
static constexpr uintptr_t kRegulatorsBase = 0x40120000UL;
#else
static constexpr uintptr_t kPowerBase = 0x5010E000UL;
static constexpr uintptr_t kResetBase = 0x5010E000UL;
static constexpr uintptr_t kRegulatorsBase = 0x50120000UL;
#endif

static NRF_POWER_Type* const g_power =
    reinterpret_cast<NRF_POWER_Type*>(kPowerBase);
static NRF_RESET_Type* const g_reset =
    reinterpret_cast<NRF_RESET_Type*>(kResetBase);
static NRF_REGULATORS_Type* const g_regulators =
    reinterpret_cast<NRF_REGULATORS_Type*>(kRegulatorsBase);

static inline void cpuIdleWfi() {
  __asm volatile("wfi");
}

static uint32_t readResetReason() {
  return g_reset->RESETREAS;
}

