lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF54.cpp
static uint8_t readGpregret0() {
  return static_cast<uint8_t>(g_power->GPREGRET[0] &
                              POWER_GPREGRET_GPREGRET_Msk);
}

#include <Adafruit_SPIFlash.h>
static bool nRF54_has_spiflash = false;
//static Adafruit_FlashTransport_QSPI *FlashTrans = NULL;
static Adafruit_FlashTransport_SPI  *FlashTrans = NULL;
static Adafruit_SPIFlash            *SPIFlash   = NULL;

/// Flash device list count
enum {
  MX25R6435F_INDEX,

  EXTERNAL_FLASH_DEVICE_COUNT
};

/// List of all possible flash devices used by nRF52840 boards
static SPIFlash_Device_t possible_devices[] = {
  [MX25R6435F_INDEX] = MX25R6435F,
};


static void nRF54_setup()
{
  uint32_t reset_reason = readResetReason();

  if      (reset_reason & RESET_RESETREAS_RESETPIN_Msk)
  {
      reset_info.reason = REASON_EXT_SYS_RST;
  }
  else if (reset_reason & (RESET_RESETREAS_DOG0_Msk | RESET_RESETREAS_DOG1_Msk))
  {
      reset_info.reason = REASON_WDT_RST;
  }
  else if (reset_reason & RESET_RESETREAS_SREQ_Msk)
  {
      reset_info.reason = REASON_SOFT_RESTART;
  }
  else if (reset_reason & RESET_RESETREAS_LOCKUP_Msk)
  {
      reset_info.reason = REASON_SOFT_WDT_RST;
  }
  else if (reset_reason & RESET_RESETREAS_OFF_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & RESET_RESETREAS_LPCOMP_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & RESET_RESETREAS_DIF_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
  }
  else if (reset_reason & RESET_RESETREAS_NFC_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
#if NRF_RESET_HAS_VBUS_RESET
  }
  else if (reset_reason & RESET_RESETREAS_VBUS_Msk)
  {
      reset_info.reason = REASON_DEEP_SLEEP_AWAKE;
#endif
  }

  Wire.setPins(SOC_GPIO_PIN_EVK_SDA, SOC_GPIO_PIN_EVK_SCL);
  Wire.begin();
  Wire.beginTransmission(SSD1306_OLED_I2C_ADDR);
  if (Wire.endTransmission() == 0) {
    nRF54_board = NRF54_LR2021EVK1XCS1;
  }
  // Wire.end();

  pinMode(SOC_GPIO_PIN_MX25_RST,  OUTPUT);
  pinMode(SOC_GPIO_PIN_MX25_BUSY, INPUT);

  digitalWrite(SOC_GPIO_PIN_MX25_RST, LOW);

  delay(10);

  if (digitalRead(SOC_GPIO_PIN_MX25_BUSY) == HIGH) {
    digitalWrite(SOC_GPIO_PIN_MX25_RST, HIGH);

    delay(50);

    if (digitalRead(SOC_GPIO_PIN_MX25_BUSY) == LOW) {
    nRF54_board = NRF54_MX25LE02;
    }
  }

  pinMode(SOC_GPIO_PIN_MX25_RST, INPUT);

#if defined(ARDUINO_NRF54L15DK_PCA10156)
  /* (Q)SPI flash init */
  switch (nRF54_board)
  {
    case NRF54_LR2021EVK1XCS1:
    case NRF54_PCA10156:
      possible_devices[MX25R6435F_INDEX].max_clock_speed_mhz  = 33;
      possible_devices[MX25R6435F_INDEX].supports_qspi        = false;
      possible_devices[MX25R6435F_INDEX].supports_qspi_writes = false;
#if 0
      FlashTrans = new Adafruit_FlashTransport_QSPI(SOC_GPIO_PIN_SFL_DK_SCK,
                                                    SOC_GPIO_PIN_SFL_DK_SS,
                                                    SOC_GPIO_PIN_SFL_DK_MOSI,
                                                    SOC_GPIO_PIN_SFL_DK_MISO,
                                                    SOC_GPIO_PIN_SFL_DK_WP,
                                                    SOC_GPIO_PIN_SFL_DK_HOLD);
#else
      SPI.setPins(SOC_GPIO_PIN_EVK_SCK,
                  SOC_GPIO_PIN_EVK_MISO,
                  SOC_GPIO_PIN_EVK_MOSI,
                  SOC_GPIO_PIN_SFL_DK_SS);
      FlashTrans = new Adafruit_FlashTransport_SPI(SOC_GPIO_PIN_SFL_DK_SS, SPI);
#endif
      break;
    default:
      break;
  }

  if (FlashTrans != NULL) {
    FlashTrans->begin();
    FlashTrans->runCommand(0xAB); /* RDP/RES */
    FlashTrans->end();

    SPIFlash = new Adafruit_SPIFlash(FlashTrans);
    nRF54_has_spiflash = SPIFlash->begin(possible_devices,
                                         EXTERNAL_FLASH_DEVICE_COUNT);
  }
#endif /* ARDUINO_NRF54L15DK_PCA10156 */

  if (nRF54_has_spiflash) {
    nRF54_board = NRF54_PCA10156;
    hw_info.storage = STORAGE_FLASH;
  }

  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
#if !defined(USE_RTT)
      Serial.setPins(SOC_GPIO_PIN_CONS_MX25_RX, SOC_GPIO_PIN_CONS_MX25_TX);
#endif /* USE_RTT */
      Wire.setPins(SOC_GPIO_PIN_MX25_SDA, SOC_GPIO_PIN_MX25_SCL);

      lmic_pins.nss  = SOC_GPIO_PIN_MX25_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_MX25_RST;
      lmic_pins.busy = SOC_GPIO_PIN_MX25_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_MX25_DIO1;
#endif /* USE_RADIOLIB */

      pinMode(SOC_GPIO_PIN_MX25_STATUS,       OUTPUT);
      digitalWrite(SOC_GPIO_PIN_MX25_STATUS,  LED_STATE_ON);

      pinMode(SOC_GPIO_PIN_MX25_BUTTON,       INPUT_PULLUP);

      pinMode(SOC_GPIO_PIN_MX25_ANT_SW2,      OUTPUT);
      digitalWrite(SOC_GPIO_PIN_MX25_ANT_SW2, HIGH);

      break;

#if defined(ARDUINO_NRF54L15DK_PCA10156)
    case NRF54_PCA10156:
#if !defined(USE_RTT)
      Serial.setPins(SOC_GPIO_PIN_CONS_DK_RX, SOC_GPIO_PIN_CONS_DK_TX);
#endif /* USE_RTT */

      lmic_pins.nss  = SOC_GPIO_PIN_EVK_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_EVK_RST;
      lmic_pins.busy = SOC_GPIO_PIN_EVK_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_EVK_DIO8;
#endif /* USE_RADIOLIB */

      pinMode(SOC_GPIO_PIN_DK_LED0,     OUTPUT);
      digitalWrite(SOC_GPIO_PIN_DK_LED0, ! LED_STATE_ON);

      break;
#endif /* ARDUINO_NRF54L15DK_PCA10156 */

    case NRF54_LR2021EVK1XCS1:
    default:
#if !defined(USE_RTT)
      Serial.setPins(SOC_GPIO_PIN_CONS_EVK_RX, SOC_GPIO_PIN_CONS_EVK_TX);
#endif /* USE_RTT */

      lmic_pins.nss  = SOC_GPIO_PIN_EVK_SS;
      lmic_pins.rst  = SOC_GPIO_PIN_EVK_RST;
      lmic_pins.busy = SOC_GPIO_PIN_EVK_BUSY;
#if defined(USE_RADIOLIB)
      lmic_pins.dio[0] = SOC_GPIO_PIN_EVK_DIO8;
#endif /* USE_RADIOLIB */

      pinMode(SOC_GPIO_PIN_EVK_STATUS,     OUTPUT);
      digitalWrite(SOC_GPIO_PIN_EVK_STATUS, LED_STATE_ON);

      pinMode(SOC_GPIO_PIN_EVK_BUTTON_AUX, INPUT_PULLUP);

