lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF54.cpp
      pinMode(SOC_GPIO_PIN_EVK_ANT_PWR,    OUTPUT);
      digitalWrite(SOC_GPIO_PIN_EVK_ANT_PWR, HIGH);

      #if defined(ARDUINO_XIAO_NRF54L15_CLEAN)
      BoardControl::setBatterySenseEnabled(true);

      xiaoNrf54l15SetAntenna(XIAO_NRF54L15_ANTENNA_CERAMIC);
      #else
      // pinMode(SOC_GPIO_PIN_EVK_VBAT_EN,    INPUT_PULLDOWN);

      pinMode(SOC_GPIO_PIN_EVK_ANT_SW,     INPUT_PULLDOWN); /* ANT 1 */
      #endif /* ARDUINO_XIAO_NRF54L15_CLEAN */

      break;
  }

#if !defined(USE_RTT)
  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* USE_RTT */
}

static void nRF54_post_init()
{
  Serial.println();
  Serial.println(F("SoftRF Academy Edition Power-on Self Test"));
  Serial.println();
  Serial.flush();

  Serial.print(F("Board: "));
  Serial.println(nRF54_board == NRF54_LR2021EVK1XCS1 ?
                 "Seeed & Semtech LR2021EVK1XCS1" : "Minewsemi MX25LE02");
  Serial.println();
  Serial.flush();

  Serial.println(F("Built-in components:"));

  Serial.print(F("RADIO   : "));
  Serial.println(hw_info.rf      != RF_IC_NONE        ? F("PASS") : F("FAIL"));

  Serial.println();

  Serial.println(F("External components:"));

  Serial.print(F("GNSS    : "));
  Serial.println(hw_info.gnss    != GNSS_MODULE_NONE  ? F("PASS") : F("FAIL"));
  Serial.print(F("BARO    : "));
  Serial.println(hw_info.baro    != BARO_MODULE_NONE  ? F("PASS") : F("N/A"));
  Serial.print(F("DISPLAY : "));
  Serial.println(hw_info.display != DISPLAY_NONE      ? F("PASS") : F("N/A"));

  Serial.println();
  Serial.println(F("Power-on Self Test is complete."));
  Serial.println();
  Serial.flush();

  Serial.println(F("Data output device(s):"));

  Serial.print(F("NMEA   - "));
  switch (settings->nmea_out)
  {
    case NMEA_UART       :  Serial.println(F("UART"));          break;
    case NMEA_BLUETOOTH  :  Serial.println(F("Bluetooth LE"));  break;
    case NMEA_OFF        :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.print(F("GDL90  - "));
  switch (settings->gdl90)
  {
    case GDL90_UART      :  Serial.println(F("UART"));          break;
    case GDL90_BLUETOOTH :  Serial.println(F("Bluetooth LE"));  break;
    case GDL90_OFF       :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.print(F("D1090  - "));
  switch (settings->d1090)
  {
    case D1090_UART      :  Serial.println(F("UART"));          break;
    case D1090_BLUETOOTH :  Serial.println(F("Bluetooth LE"));  break;
    case D1090_OFF       :
    default              :  Serial.println(F("NULL"));          break;
  }

  Serial.println();
  Serial.flush();

#if defined(USE_OLED)
  if (hw_info.display == DISPLAY_OLED_1_3 ||
      hw_info.display == DISPLAY_OLED_TTGO) {
    OLED_info1();
  }
#endif /* USE_OLED */
}

static void nRF54_loop()
{
  if (wdt_is_active && g_wdt.isRunning()) {
    g_wdt.feed();
  }

#if defined(NOT_AN_INTERRUPT)
  if (SOC_GPIO_PIN_GNSS_PPS != SOC_UNUSED_PIN) {
    static bool prev_PPS_state = LOW;

    if (digitalPinToInterrupt(SOC_GPIO_PIN_GNSS_PPS) == NOT_AN_INTERRUPT) {
      bool PPS_state = digitalRead(SOC_GPIO_PIN_GNSS_PPS);

      if (PPS_state == HIGH && prev_PPS_state == LOW) {
        PPS_TimeMarker = millis();
      }
      prev_PPS_state = PPS_state;
    }
  }
#endif
}

static PowerManager g_powerManager;
static uint32_t nRF54_getChipId(void);

static constexpr uint8_t kSystemOffMagic = 0xA5U;

static void configureButtonSenseLowWake() {
  if (kPinUserButton.port != 0U) {
    return;
  }

  (void)Gpio::configure(kPinUserButton, GpioDirection::kInput,
                        nRF54_getChipId() == 0x21A44298 ? GpioPull::kPullUp :
                        nRF54_getChipId() == 0xFCE0D9E0 ? GpioPull::kPullUp :
                        GpioPull::kDisabled);

  // SYSTEM OFF wake is done through the GPIO DETECT sense mechanism, not
  // through a normal attachInterrupt() wake path.
  uint32_t cnf = NRF_P0->PIN_CNF[kPinUserButton.pin];
  cnf &= ~GPIO_PIN_CNF_SENSE_Msk;
  cnf |= (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos);
  if (nRF54_getChipId() == 0x21A44298 || nRF54_getChipId() == 0xFCE0D9E0) {
    cnf |= GPIO_PIN_CNF_PULL_Pullup;
  }
  NRF_P0->PIN_CNF[kPinUserButton.pin] = cnf;
}

static void requestLowPowerLatencyMode() {
  g_power->TASKS_LOWPWR = POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger;
}

static void writeGpregret0(uint8_t value) {
  g_power->GPREGRET[0] = static_cast<uint32_t>(value);
}

static void nRF54_fini(int reason)
{
  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
      digitalWrite(SOC_GPIO_PIN_MX25_STATUS, !LED_STATE_ON);
      pinMode(SOC_GPIO_PIN_MX25_STATUS,      INPUT);

      pinMode(SOC_GPIO_PIN_MX25_ANT_SW2,     INPUT);
      break;

    case NRF54_LR2021EVK1XCS1:
    default:
      digitalWrite(SOC_GPIO_PIN_EVK_STATUS,  !LED_STATE_ON);
      pinMode(SOC_GPIO_PIN_EVK_STATUS,       INPUT);

      pinMode(SOC_GPIO_PIN_EVK_BUTTON_AUX,   INPUT);
      pinMode(SOC_GPIO_PIN_EVK_ANT_PWR,      INPUT);

      #if defined(ARDUINO_XIAO_NRF54L15_CLEAN)
      BoardControl::setBatterySenseEnabled(false);
      #else
      // pinMode(SOC_GPIO_PIN_EVK_VBAT_EN,      INPUT);
      pinMode(SOC_GPIO_PIN_EVK_ANT_SW,       INPUT);
      #endif /* ARDUINO_XIAO_NRF54L15_CLEAN */

      break;
  }

  Serial_GNSS_In.end();
  Wire.end();

  pinMode(lmic_pins.nss, INPUT_PULLUP);
  pinMode(lmic_pins.rst, INPUT);

  int mode_button_pin;

  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
      mode_button_pin = SOC_GPIO_PIN_MX25_BUTTON;
      break;

#if defined(ARDUINO_NRF54L15DK_PCA10156)
    case NRF54_PCA10156:
      mode_button_pin = SOC_GPIO_PIN_DK_BUTTON0;
      break;
#endif /* ARDUINO_NRF54L15DK_PCA10156 */

    case NRF54_LR2021EVK1XCS1:
    default:
      mode_button_pin = SOC_GPIO_PIN_EVK_BUTTON;
      break;
  }

  pinMode(mode_button_pin, nRF54_getChipId() == 0x21A44298 ? INPUT_PULLUP :
                           nRF54_getChipId() == 0xFCE0D9E0 ? INPUT_PULLUP :
                           nRF54_board  ==  NRF54_PCA10156 ? INPUT_PULLUP :
                           INPUT);
  while (digitalRead(mode_button_pin) == LOW);
  delay(100);

