lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF54.cpp
#if 0
  Serial.end();

  g_regulators->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;

  __asm volatile("dsb 0xF" ::: "memory");

  while (true) {
    cpuIdleWfi();
  }
#else
  configureButtonSenseLowWake();
  requestLowPowerLatencyMode();
  writeGpregret0(kSystemOffMagic);

  Serial.println("Entering SYSTEM OFF. Wake by pressing USER button.");
  Serial.flush();
  delay(2);

#if !defined(USE_RTT)
  Serial.end();
#endif /* USE_RTT */

  g_powerManager.systemOffNoRetention();
#endif
}

static void nRF54_reset()
{
  if (wdt_is_active && g_wdt.isRunning()) {
    switch (hw_info.display)
    {
#if defined(USE_OLED)
    case DISPLAY_OLED_1_3:
    case DISPLAY_OLED_TTGO:
    case DISPLAY_OLED_HELTEC:
      OLED_fini(SOFTRF_SHUTDOWN_NONE);
      break;
#endif /* USE_OLED */

    case DISPLAY_NONE:
    default:
      break;
    }

    while (true) { delay(100); }
  } else {
    SoftReset();
  }
}

static uint32_t nRF54_getChipId()
{
  uint32_t ficrBase = nrf54l15::FICR_BASE;
  NRF_FICR_Type* const ficr = reinterpret_cast<NRF_FICR_Type*>(ficrBase);

  const uint32_t lo = ficr->DEVICEADDR[0];
  const uint32_t hi = ficr->DEVICEADDR[1];

#if !defined(SOFTRF_ADDRESS)
  uint32_t id = lo;

  return DevID_Mapper(id);
#else
  return (SOFTRF_ADDRESS & 0xFFFFFFFFU );
#endif
}

static void* nRF54_getResetInfoPtr()
{
  return (void *) &reset_info;
}

static String nRF54_getResetInfo()
{
  switch (reset_info.reason)
  {
    default                     : return F("No reset information available");
  }
}

static String nRF54_getResetReason()
{
  switch (reset_info.reason)
  {
    case REASON_DEFAULT_RST       : return F("DEFAULT");
    case REASON_WDT_RST           : return F("WDT");
    case REASON_EXCEPTION_RST     : return F("EXCEPTION");
    case REASON_SOFT_WDT_RST      : return F("SOFT_WDT");
    case REASON_SOFT_RESTART      : return F("SOFT_RESTART");
    case REASON_DEEP_SLEEP_AWAKE  : return F("DEEP_SLEEP_AWAKE");
    case REASON_EXT_SYS_RST       : return F("EXT_SYS");
    default                       : return F("NO_MEAN");
  }
}

static uint32_t nRF54_getFreeHeap()
{
  return getFreeHeap();
}

static long nRF54_random(long howsmall, long howBig)
{
  return random(howsmall, howBig);
}

static void nRF54_Sound_test(int var)
{
#if defined(USE_PWM_SOUND)
  if (SOC_GPIO_PIN_BUZZER != SOC_UNUSED_PIN && settings->volume != BUZZER_OFF) {
    pinMode(SOC_GPIO_PIN_BUZZER, OUTPUT);

    tone(SOC_GPIO_PIN_BUZZER, 440,  500); // delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 640,  500); // delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 840,  500); // delay(500);
    tone(SOC_GPIO_PIN_BUZZER, 1040, 500); // delay(600);

    noTone(SOC_GPIO_PIN_BUZZER);
    pinMode(SOC_GPIO_PIN_BUZZER, INPUT);
  }
#endif /* USE_PWM_SOUND */
}

static void nRF54_Sound_tone(int hz, uint8_t volume)
{
#if defined(USE_PWM_SOUND)
  if (SOC_GPIO_PIN_BUZZER != SOC_UNUSED_PIN && volume != BUZZER_OFF) {
    if (hz > 0) {
      pinMode(SOC_GPIO_PIN_BUZZER, OUTPUT);
      tone(SOC_GPIO_PIN_BUZZER, hz, ALARM_TONE_MS);
    } else {
      noTone(SOC_GPIO_PIN_BUZZER);
      pinMode(SOC_GPIO_PIN_BUZZER, INPUT);
    }
  }
#endif /* USE_PWM_SOUND */
}

static void nRF54_WiFi_set_param(int ndx, int value)
{
  /* NONE */
}

static void nRF54_WiFi_transmit_UDP(int port, byte *buf, size_t size)
{
  /* NONE */
}

static bool nRF54_EEPROM_begin(size_t size)
{
#if !defined(EXCLUDE_EEPROM)
  if (size > EEPROM.length()) {
    return false;
  }

  EEPROM.begin();
#endif /* EXCLUDE_EEPROM */

  return true;
}

static void nRF54_EEPROM_extension(int cmd)
{

}

static void nRF54_SPI_begin()
{
#if defined(USE_SOFTSPI)
  SPI.begin();
#else
  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
      SPI.setPins(SOC_GPIO_PIN_MX25_SCK,
                  SOC_GPIO_PIN_MX25_MISO,
                  SOC_GPIO_PIN_MX25_MOSI,
                  SOC_GPIO_PIN_MX25_SS);
      SPI.begin(SOC_GPIO_PIN_MX25_SS);
      break;

    case NRF54_LR2021EVK1XCS1:
    case NRF54_PCA10156:
    default:
      SPI.setPins(SOC_GPIO_PIN_EVK_SCK,
                  SOC_GPIO_PIN_EVK_MISO,
                  SOC_GPIO_PIN_EVK_MOSI,
                  SOC_GPIO_PIN_EVK_SS);
      SPI.begin(SOC_GPIO_PIN_EVK_SS);
      break;
  }
#endif /* USE_SOFTSPI */
}

static void nRF54_swSer_begin(unsigned long baud)
{
  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_MX25_RX,
                             SOC_GPIO_PIN_GNSS_MX25_TX);
      break;

    case NRF54_LR2021EVK1XCS1:
    case NRF54_PCA10156:
    default:
      Serial_GNSS_In.setPins(SOC_GPIO_PIN_GNSS_EVK_RX,
                             SOC_GPIO_PIN_GNSS_EVK_TX);
      break;
  }

  Serial_GNSS_In.begin(baud);
}

static void nRF54_swSer_enableRx(boolean arg)
{
  /* NONE */
}

static byte nRF54_Display_setup()
{
  byte rval = DISPLAY_NONE;

  if (nRF54_board == NRF54_LR2021EVK1XCS1 ||
      nRF54_board == NRF54_MX25LE02       ||
      nRF54_board == NRF54_PCA10156) {
#if defined(USE_OLED)
    rval = OLED_setup();
#endif /* USE_OLED */
  }

  return rval;
}

static void nRF54_Display_loop()
{
  switch (hw_info.display)
  {
#if defined(USE_OLED)
  case DISPLAY_OLED_1_3:
  case DISPLAY_OLED_TTGO:
  case DISPLAY_OLED_HELTEC:
    OLED_loop();
    break;
#endif /* USE_OLED */

  case DISPLAY_NONE:
  default:
    break;
  }
}

static void nRF54_Display_fini(int reason)
{
  switch (hw_info.display)
  {
#if defined(USE_OLED)
  case DISPLAY_OLED_1_3:
  case DISPLAY_OLED_TTGO:
  case DISPLAY_OLED_HELTEC:
    OLED_fini(reason);
    break;
#endif /* USE_OLED */

  case DISPLAY_NONE:
  default:
    break;
  }
}

static void nRF54_Battery_setup()
{

}

static float nRF54_Battery_param(uint8_t param)
{
  uint32_t bat_adc_pin;
  float rval, voltage, mult;

  switch (param)
  {
  case BATTERY_PARAM_THRESHOLD:
    rval = hw_info.model == SOFTRF_MODEL_ACADEMY  ? BATTERY_THRESHOLD_LIPO   :
                                                    BATTERY_THRESHOLD_NIMHX2;
    break;

  case BATTERY_PARAM_CUTOFF:
    rval = hw_info.model == SOFTRF_MODEL_ACADEMY  ? BATTERY_CUTOFF_LIPO   :
                                                    BATTERY_CUTOFF_NIMHX2;
    break;

  case BATTERY_PARAM_CHARGE:
#if defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    {
      uint8_t vbatPercent = 0;
      BoardControl::sampleBatteryPercent(&vbatPercent);
      rval = vbatPercent;
    }
#else
    voltage = Battery_voltage();
    if (voltage < Battery_cutoff())
      return 0;

    if (voltage > 4.2)
      return 100;

    if (voltage < 3.6) {
      voltage -= 3.3;
      return (voltage * 100) / 3;
    }

    voltage -= 3.6;
    rval = 10 + (voltage * 150 );
#endif /* ARDUINO_XIAO_NRF54L15_CLEAN */
    break;

  case BATTERY_PARAM_VOLTAGE:
  default:
#if defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    {
      int32_t vbatMilliVolts = 0;
      BoardControl::sampleBatteryMilliVolts(&vbatMilliVolts);
      voltage = vbatMilliVolts;
    }
#else
    voltage = 0.0;
#if 0
    // Set the analog reference to 3.0V (default = 3.6V)
    analogReference(AR_INTERNAL_3_0);
#endif
    // Set the resolution to 12-bit (0..4095)
    analogReadResolution(12); // Can be 8, 10, 12 or 14

    // Let the ADC settle
    delay(1);

