lyusupov/SoftRF/software/firmware/source/SoftRF/src/platform/nRF54.cpp
    switch (nRF54_board)
    {
      case NRF54_MX25LE02:
      case NRF54_PCA10156:
      case NRF54_LR2021EVK1XCS1:
      default:
        bat_adc_pin = SOC_GPIO_PIN_EVK_BATTERY;
        mult        = SOC_ADC_EVK_VOLTAGE_DIV;
        break;
    }

    // Get the raw 12-bit, 0..3000mV ADC value
    voltage = analogRead(bat_adc_pin);

    // Set the ADC back to the default settings
#if 0
    analogReference(AR_DEFAULT);
#endif
    analogReadResolution(10);

    // Convert the raw value to compensated mv, taking the resistor-
    // divider into account (providing the actual LIPO voltage)
    // ADC range is 0..3000mV and resolution is 12-bit (0..4095)
    voltage *= (mult * VBAT_MV_PER_LSB);
#endif /* ARDUINO_XIAO_NRF54L15_CLEAN */
    rval = voltage * 0.001;
    break;
  }

  return rval;
}

void nRF54_GNSS_PPS_Interrupt_handler() {
  PPS_TimeMarker = millis();
}

static unsigned long nRF54_get_PPS_TimeMarker() {
  return PPS_TimeMarker;
}

static bool nRF54_Baro_setup() {
  return true;
}

static void nRF54_UATSerial_begin(unsigned long baud)
{

}

static void nRF54_UATModule_restart()
{

}

static void nRF54_WDT_setup()
{
  wdt_is_active = g_wdt.configure(4000U, 0U, false, false, true);

  if (wdt_is_active) {
    g_wdt.start();
    g_wdt.feed();
  }
}

static void nRF54_WDT_fini()
{
  if (wdt_is_active && g_wdt.isRunning()) {
    g_wdt.stop();
  }
}

#include <AceButton.h>
using namespace ace_button;

AceButton button_1(SOC_UNUSED_PIN);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType, uint8_t buttonState) {

  switch (eventType) {
    case AceButton::kEventClicked:
    case AceButton::kEventReleased:
#if defined(USE_OLED)
      if (button == &button_1 &&
         (hw_info.display == DISPLAY_OLED_1_3 ||
          hw_info.display == DISPLAY_OLED_TTGO)) {
        OLED_Next_Page();
      }
#endif /* USE_OLED */
      break;
    case AceButton::kEventDoubleClicked:

      break;
    case AceButton::kEventLongPressed:
      if (button == &button_1) {
        shutdown(SOFTRF_SHUTDOWN_BUTTON);
        Serial.println(F("This will never be printed."));
      }
      break;
  }
}

/* Callbacks for push button interrupt */
void onModeButtonEvent() {
  button_1.check();
}

static void nRF54_Button_setup()
{
  int mode_button_pin = -1;

  switch (nRF54_board)
  {
    case NRF54_MX25LE02:
      mode_button_pin = SOC_GPIO_PIN_MX25_BUTTON;
      break;

#if defined(ARDUINO_NRF54L15DK_PCA10156)
    case NRF54_PCA10156:
      mode_button_pin = SOC_GPIO_PIN_DK_BUTTON0;
      break;
#endif /* ARDUINO_NRF54L15DK_PCA10156 */

    case NRF54_LR2021EVK1XCS1:
    default:
      mode_button_pin = SOC_GPIO_PIN_EVK_BUTTON;
      break;
  }

  // Button(s) uses external pull up resistor.
  pinMode(mode_button_pin, nRF54_getChipId() == 0x21A44298 ? INPUT_PULLUP :
                           nRF54_getChipId() == 0xFCE0D9E0 ? INPUT_PULLUP :
                           nRF54_board  ==  NRF54_PCA10156 ? INPUT_PULLUP :
                           INPUT);
  button_1.init(mode_button_pin, HIGH);

  // Configure the ButtonConfig with the event handler, and enable all higher
  // level events.
  ButtonConfig* ModeButtonConfig = button_1.getButtonConfig();
  ModeButtonConfig->setEventHandler(handleEvent);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureDoubleClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterDoubleClick);
  ModeButtonConfig->setFeature(
                    ButtonConfig::kFeatureSuppressClickBeforeDoubleClick);
//  ModeButtonConfig->setDebounceDelay(15);
  ModeButtonConfig->setClickDelay(600);
  ModeButtonConfig->setDoubleClickDelay(1500);
  ModeButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(mode_button_pin), onModeButtonEvent, CHANGE );
}

static void nRF54_Button_loop()
{
  button_1.check();
}

static void nRF54_Button_fini()
{

}

static void nRF54_TTS(char *message)
{

}

static bool nRF54_ADB_setup()
{
  return false;
}

static bool nRF54_ADB_fini()
{
  return false;
}

/*
 * One aircraft CDB (20000+ records) query takes:
 * 1)     FOUND : 5-7 milliseconds
 * 2) NOT FOUND :   3 milliseconds
 */
static bool nRF54_ADB_query(uint8_t type, uint32_t id, char *buf, size_t size)
{
  return false;
}

DB_ops_t nRF54_ADB_ops = {
  nRF54_ADB_setup,
  nRF54_ADB_fini,
  nRF54_ADB_query
};

const SoC_ops_t nRF54_ops = {
  SOC_NRF54,
  "nRF54",
  nRF54_setup,
  nRF54_post_init,
  nRF54_loop,
  nRF54_fini,
  nRF54_reset,
  nRF54_getChipId,
  nRF54_getResetInfoPtr,
  nRF54_getResetInfo,
  nRF54_getResetReason,
  nRF54_getFreeHeap,
  nRF54_random,
  nRF54_Sound_test,
  nRF54_Sound_tone,
  NULL,
  nRF54_WiFi_set_param,
  nRF54_WiFi_transmit_UDP,
  NULL,
  NULL,
  NULL,
  nRF54_EEPROM_begin,
  nRF54_EEPROM_extension,
  nRF54_SPI_begin,
  nRF54_swSer_begin,
  nRF54_swSer_enableRx,
#if !defined(EXCLUDE_BLUETOOTH)
  &nRF5x_Bluetooth_ops,
#else
  NULL,
#endif /* EXCLUDE_BLUETOOTH */
  NULL,
  NULL,
  nRF54_Display_setup,
  nRF54_Display_loop,
  nRF54_Display_fini,
  nRF54_Battery_setup,
  nRF54_Battery_param,
  nRF54_GNSS_PPS_Interrupt_handler,
  nRF54_get_PPS_TimeMarker,
  nRF54_Baro_setup,
  nRF54_UATSerial_begin,
  nRF54_UATModule_restart,
  nRF54_WDT_setup,
  nRF54_WDT_fini,
  nRF54_Button_setup,
  nRF54_Button_loop,
  nRF54_Button_fini,
  nRF54_TTS,
  &nRF54_ADB_ops
};

#endif /* ARDUINO_ARCH_NRF54L15CLEAN */
